{"config": [{"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "input_dtype": "float32", "nb_filter": 32, "activation": "relu", "border_mode": "same", "batch_input_shape": [null, 50, 300, 3], "subsample": [1, 1], "name": "convolution2d_1", "W_regularizer": null, "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_filter": 16, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "name": "convolution2d_2", "W_regularizer": null, "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_filter": 8, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "name": "convolution2d_3", "W_regularizer": null, "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_filter": 4, "activation": "relu", "border_mode": "same", "subsample": [1, 1], "name": "convolution2d_4", "W_regularizer": null, "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "output_dim": 16, "trainable": true, "bias": true, "input_dtype": "float32", "activation": "relu", "b_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 15000], "name": "dense_1", "W_regularizer": null, "input_dim": 15000, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "output_dim": 1, "trainable": true, "bias": true, "input_dtype": "float32", "activation": "relu", "b_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 16], "name": "output", "W_regularizer": null, "input_dim": 16, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}